Tutorial/2022-05-17-051936-nixos_custom_pkgs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 07:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>nixos custom pkgs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">nixos custom pkgs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org60b812b">How to use custom packages</a></li>
<li><a href="#org294df7e">Tips</a>
<ul>
<li><a href="#org6093c97">Installing from a local repo</a></li>
<li><a href="#orgcfce375">error: derivation name missing</a></li>
<li><a href="#org504e4a3">error: syntax error, unexpected ID, expecting &rsquo;:&rsquo; or &rsquo;@&rsquo;</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org60b812b" class="outline-2">
<h2 id="org60b812b">How to use custom packages</h2>
<div class="outline-text-2" id="text-org60b812b">
<p>
i have built a some packages myself and i cant find a way to use my overlay.
Instead i maintain a nix-channel and point it my gitrepo with a archive url
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffd400;">sudo</span> nix-channel --add https://github.com/lost-rob0t/nixos-overlays/archive/d183b152436003690cf0e4e6ea15018e6ac38230.tar.gz personal
<span style="color: #ffd400;">sudo</span> nix-channel --update
</pre>
</div>
<p>
After you add the channel at the top of your configuration.nix
add the following
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #ff2afc; font-weight: bold;">let</span> <span style="color: #df85ff;">otherPkgs</span> = <span style="color: #1ea8fc;">import</span> <span style="color: #df85ff; font-weight: bold;">&lt;other-channel&gt;</span> {}
<span style="color: #ff2afc; font-weight: bold;">in</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org294df7e" class="outline-2">
<h2 id="org294df7e">Tips</h2>
<div class="outline-text-2" id="text-org294df7e">
</div>
<div id="outline-container-org6093c97" class="outline-3">
<h3 id="org6093c97">Installing from a local repo</h3>
<div class="outline-text-3" id="text-org6093c97">
<p>
This is mostly used for development of packages but can be used to install ad-hoc fixes quickly
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffd400;">mkdir</span> -p ~/git/ &amp;&amp; <span style="color: #ffd400;">cd</span> ~/git/
<span style="color: #ffd400;">git</span> clone --depth=<span style="color: #ffd400; font-weight: bold;">1</span> https://github.com/nixos/nixpkgs
<span style="color: #1ea8fc;">export</span> <span style="color: #df85ff;">NIXPKGS</span>=~/git/nixpkgs
<span style="color: #ffd400;">ls</span> $<span style="color: #df85ff;">NIXPKGS</span>
</pre>
</div>

<p>
Build an expression
</p>
<div class="org-src-container">
<pre class="src src-shell">nix-build $<span style="color: #df85ff;">NIXPKG</span> -A firefox
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcfce375" class="outline-3">
<h3 id="orgcfce375">error: derivation name missing</h3>
<div class="outline-text-3" id="text-orgcfce375">
<p>
Version was not included.
</p>

<p>
This will fail
</p>
<div class="org-src-container">
<pre class="src src-nix">{ lib, stdenv, nimPackages, fetchurl }:

stdenv.mkDerivation <span style="color: #ff2afc; font-weight: bold;">rec</span> {
  <span style="color: #df85ff;">nimsuggest</span> = nimPackages.buildNimPackage <span style="color: #ff2afc; font-weight: bold;">rec</span> {
    <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"nimsuggest"</span>;
    <span style="color: #df85ff;">rev</span> = <span style="color: #7984D1;">"f780247b651f28d6e3f1ae8d0067316a8086027e"</span>;

    <span style="color: #df85ff;">nimBinOnly</span> = <span style="color: #1ea8fc;">true</span>;

    <span style="color: #df85ff;">src</span> = fetchurl {
      <span style="color: #df85ff;">url</span> = <span style="color: #7984D1;">"https://github.com/nim-lang/</span><span style="color: #ff2afc; font-weight: bold;">${</span>name<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">/archive/</span><span style="color: #ff2afc; font-weight: bold;">${</span>rev<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">.tar.gz"</span>;
      <span style="color: #df85ff;">sha256</span> = <span style="color: #7984D1;">"sha256-hAqlBGiOQk9QVbtDhNHpk5Z7EtyeW02hRlYMxbvb++Q="</span>;
    };
  };
  <span style="color: #df85ff;">pname</span> = <span style="color: #7984D1;">"nimsuggest"</span>;
  <span style="color: #df85ff;">buildInputs</span> = [ nimsuggest ];
  <span style="color: #df85ff;">meta</span> = <span style="color: #ff2afc; font-weight: bold;">with</span> lib; {
    <span style="color: #df85ff;">description</span> = <span style="color: #7984D1;">"Tool for providing auto completion data for Nim source code."</span>;
    <span style="color: #df85ff;">homepage</span> = <span style="color: #7984D1;">"https://github.com/nim-lang/nimsuggest/"</span>;
    <span style="color: #df85ff;">license</span> = licenses.mit;
    <span style="color: #df85ff;">maintainers</span> = [ <span style="color: #7984D1;">"nsaspy"</span> ];
    };
  }

</pre>
</div>

<p>
Always have the version!
</p>
<div class="org-src-container">
<pre class="src src-nix">{ lib, stdenv, nimPackages, fetchurl }:

stdenv.mkDerivation <span style="color: #ff2afc; font-weight: bold;">rec</span> {
  <span style="color: #df85ff;">nimsuggest</span> = nimPackages.buildNimPackage <span style="color: #ff2afc; font-weight: bold;">rec</span> {
    <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"nimsuggest"</span>;
    <span style="color: #df85ff;">rev</span> = <span style="color: #7984D1;">"f780247b651f28d6e3f1ae8d0067316a8086027e"</span>;

    <span style="color: #df85ff;">nimBinOnly</span> = <span style="color: #1ea8fc;">true</span>;

    <span style="color: #df85ff;">src</span> = fetchurl {
      <span style="color: #df85ff;">url</span> = <span style="color: #7984D1;">"https://github.com/nim-lang/</span><span style="color: #ff2afc; font-weight: bold;">${</span>name<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">/archive/</span><span style="color: #ff2afc; font-weight: bold;">${</span>rev<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">.tar.gz"</span>;
      <span style="color: #df85ff;">sha256</span> = <span style="color: #7984D1;">"sha256-OmIuOkHP9Uvrm0NLpPAlrhuP4WPEeXSxzAzDn2AuvQ0="</span>;
    };
  };
  <span style="color: #df85ff;">pname</span> = <span style="color: #7984D1;">"nimsuggest"</span>;
  <span style="color: #df85ff;">buildInputs</span> = [ nimsuggest ];

  <span style="color: #df85ff;">version</span> = <span style="color: #7984D1;">"0.1.0"</span>;
  <span style="color: #df85ff;">meta</span> = <span style="color: #ff2afc; font-weight: bold;">with</span> lib; {
    <span style="color: #df85ff;">description</span> = <span style="color: #7984D1;">"Tool for providing auto completion data for Nim source code."</span>;
    <span style="color: #df85ff;">homepage</span> = <span style="color: #7984D1;">"https://github.com/nim-lang/nimsuggest/"</span>;
    <span style="color: #df85ff;">license</span> = licenses.mit;
    <span style="color: #df85ff;">maintainers</span> = [ <span style="color: #7984D1;">"nsaspy"</span> ];
    };
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org504e4a3" class="outline-3">
<h3 id="org504e4a3">error: syntax error, unexpected ID, expecting &rsquo;:&rsquo; or &rsquo;@&rsquo;</h3>
<div class="outline-text-3" id="text-org504e4a3">
<p>
This was painful you simply forgot to include a <code>:</code>
Wrong
</p>
<div class="org-src-container">
<pre class="src src-nix">{ buildNimPackage, jsony, fetchzip }
</pre>
</div>

<p>
Correct:
</p>
<div class="org-src-container">
<pre class="src src-nix">{ buildNimPackage, jsony, fetchzip }:
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p>
<p class="validation"></p>
</div>
</body>
</html>